<?php
namespace Cuaround\SiteBundle\Entity;

use Doctrine\Common\Collections\ArrayCollection;
use Doctrine\ORM\Mapping as ORM;
use Doctrine\ORM\Mapping\OrderBy;
use Symfony\Component\Validator\Constraints as Assert;
use JMS\SerializerBundle\Annotation\ExclusionPolicy;
use JMS\SerializerBundle\Annotation\Expose;
use JMS\SerializerBundle\Annotation\Accessor;

/**
 * @ORM\Entity
 * @ORM\Table()
 * @ExclusionPolicy("all")
 */
class Municipality {
    /**
     * @ORM\Id
     * @ORM\Column(type="integer")
     * @ORM\GeneratedValue(strategy="AUTO")
     * @Expose
     */
    protected $id;

    /**
     * @ORM\Column(name="name", type="string")
     *
     * @Assert\MaxLength(limit="255", message="The name is too long.")
     * @Expose
     */
    protected $name;

    /**
     * @ORM\OneToMany(targetEntity="Destination", mappedBy="municipality", cascade={"persist"})
     */
    protected $destinations;

    public function __construct() {
        $this->tables = new ArrayCollection();
    }

    public function getId() {
        return $this->id;
    }

    public function setId($id) {
        $this->id = $id;
    }

    public function getName() {
        return $this->name;
    }

    public function setName($name) {
        $this->name = $name;
    }

    public function getTables() {
        return $this->tables;
    }

    public function setTables($tables) {
        $this->tables = $tables;
    }

    public function getDestinations() {
        return $this->destinations;
    }

    public function setDestinations($destinations) {
        $this->destinations = $destinations;
    }

    public static function getMunicipalities() {
        return array(
            0 => "ΔΗΜΟΣ ΑΒΔΗΡΩΝ",
            1 => "ΔΗΜΟΣ ΑΓΑΘΟΝΗΣΙΟΥ",
            2 => "ΔΗΜΟΣ ΑΓΙΑΣ",
            3 => "ΔΗΜΟΣ ΑΓΙΑΣ ΒΑΡΒΑΡΑΣ",
            4 => "ΔΗΜΟΣ ΑΓΙΑΣ ΠΑΡΑΣΚΕΥΗΣ",
            5 => "ΔΗΜΟΣ ΑΓΙΟΥ ΒΑΣΙΛΕΙΟΥ",
            6 => "ΔΗΜΟΣ ΑΓΙΟΥ ΔΗΜΗΤΡΙΟΥ",
            7 => "ΔΗΜΟΣ ΑΓΙΟΥ ΕΥΣΤΡΑΤΙΟΥ",
            8 => "ΔΗΜΟΣ ΑΓΙΟΥ ΝΙΚΟΛΑΟΥ",
            9 => "ΔΗΜΟΣ ΑΓΙΩΝ ΑΝΑΡΓΥΡΩΝ - ΚΑΜΑΤΕΡΟΥ",
            10 => "ΔΗΜΟΣ ΑΓΚΙΣΤΡΙΟΥ",
            11 => "ΔΗΜΟΣ ΑΓΡΑΦΩΝ",
            12 => "ΔΗΜΟΣ ΑΓΡΙΝΙΟΥ",
            13 => "ΔΗΜΟΣ ΑΘΗΝΑΙΩΝ",
            14 => "ΔΗΜΟΣ ΑΙΓΑΛΕΩ",
            15 => "ΔΗΜΟΣ ΑΙΓΙΑΛΕΙΑΣ",
            16 => "ΔΗΜΟΣ ΑΙΓΙΝΑΣ",
            17 => "ΔΗΜΟΣ ΑΚΤΙΟΥ-ΒΟΝΙΤΣΑΣ",
            18 => "ΔΗΜΟΣ ΑΛΕΞΑΝΔΡΕΙΑΣ",
            19 => "ΔΗΜΟΣ ΑΛΕΞΑΝΔΡΟΥΠΟΛΗΣ",
            20 => "ΔΗΜΟΣ ΑΛΙΑΡΤΟΥ",
            21 => "ΔΗΜΟΣ ΑΛΙΜΟΥ",
            22 => "ΔΗΜΟΣ ΑΛΜΥΡΟΥ",
            23 => "ΔΗΜΟΣ ΑΛΜΩΠΙΑΣ",
            24 => "ΔΗΜΟΣ ΑΛΟΝΝΗΣΟΥ",
            25 => "ΔΗΜΟΣ ΑΜΑΡΙΟΥ",
            26 => "ΔΗΜΟΣ ΑΜΑΡΟΥΣΙΟΥ",
            27 => "ΔΗΜΟΣ ΑΜΟΡΓΟΥ",
            28 => "ΔΗΜΟΣ ΑΜΠΕΛΟΚΗΠΩΝ - ΜΕΝΕΜΕΝΗΣ",
            29 => "ΔΗΜΟΣ ΑΜΥΝΤΑΙΟΥ",
            30 => "ΔΗΜΟΣ ΑΜΦΙΚΛΕΙΑΣ - ΕΛΑΤΕΙΑΣ",
            31 => "ΔΗΜΟΣ ΑΜΦΙΛΟΧΙΑΣ",
            32 => "ΔΗΜΟΣ ΑΜΦΙΠΟΛΗΣ",
            33 => "ΔΗΜΟΣ ΑΝΑΤΟΛΙΚΗΣ ΜΑΝΗΣ",
            34 => "ΔΗΜΟΣ ΑΝΑΦΗΣ",
            35 => "ΔΗΜΟΣ ΑΝΔΡΑΒΙΔΑΣ - ΚΥΛΛΗΝΗΣ",
            36 => "ΔΗΜΟΣ ΑΝΔΡΙΤΣΑΙΝΑΣ - ΚΡΕΣΤΕΝΩΝ",
            37 => "ΔΗΜΟΣ ΑΝΔΡΟΥ",
            38 => "ΔΗΜΟΣ ΑΝΤΙΠΑΡΟΥ",
            39 => "ΔΗΜΟΣ ΑΝΩΓΕΙΩΝ",
            40 => "ΔΗΜΟΣ ΑΠΟΚΟΡΩΝΟΥ",
            41 => "ΔΗΜΟΣ ΑΡΓΙΘΕΑΣ",
            42 => "ΔΗΜΟΣ ΑΡΓΟΥΣ - ΜΥΚΗΝΩΝ",
            43 => "ΔΗΜΟΣ ΑΡΙΣΤΟΤΕΛΗ",
            44 => "ΔΗΜΟΣ ΑΡΡΙΑΝΩΝ",
            45 => "ΔΗΜΟΣ ΑΡΤΑΙΩΝ",
            46 => "ΔΗΜΟΣ ΑΡΧΑΙΑΣ ΟΛΥΜΠΙΑΣ",
            47 => "ΔΗΜΟΣ ΑΡΧΑΝΩΝ - ΑΣΤΕΡΟΥΣΙΩΝ",
            48 => "ΔΗΜΟΣ ΑΣΠΡΟΠΥΡΓΟΥ",
            49 => "ΔΗΜΟΣ ΑΣΤΥΠΑΛΑΙΑΣ",
            50 => "ΔΗΜΟΣ ΑΧΑΡΝΩΝ",
            51 => "ΔΗΜΟΣ ΒΑΡΗΣ - ΒΟΥΛΑΣ - ΒΟΥΛΙΑΓΜΕΝΗΣ",
            52 => "ΔΗΜΟΣ ΒΕΛΟΥ - ΒΟΧΑΣ",
            53 => "ΔΗΜΟΣ ΒΕΡΟΙΑΣ",
            54 => "ΔΗΜΟΣ ΒΙΑΝΝΟΥ",
            55 => "ΔΗΜΟΣ ΒΙΣΑΛΤΙΑΣ",
            56 => "ΔΗΜΟΣ ΒΟΙΟΥ",
            57 => "ΔΗΜΟΣ ΒΟΛΒΗΣ",
            58 => "ΔΗΜΟΣ ΒΟΛΟΥ",
            59 => "ΔΗΜΟΣ ΒΟΡΕΙΑΣ ΚΥΝΟΥΡΙΑΣ",
            60 => "ΔΗΜΟΣ ΒΟΡΕΙΩΝ ΤΖΟΥΜΕΡΚΩΝ",
            61 => "ΔΗΜΟΣ ΒΡΙΛΗΣΣΙΩΝ",
            62 => "ΔΗΜΟΣ ΒΥΡΩΝΟΣ",
            63 => "ΔΗΜΟΣ ΓΑΛΑΤΣΙΟΥ",
            64 => "ΔΗΜΟΣ ΓΑΥΔΟΥ",
            65 => "ΔΗΜΟΣ ΓΕΩΡΓΙΟΥ ΚΑΡΑΪΣΚΑΚΗ",
            66 => "ΔΗΜΟΣ ΓΛΥΦΑΔΑΣ",
            67 => "ΔΗΜΟΣ ΓΟΡΤΥΝΑΣ",
            68 => "ΔΗΜΟΣ ΓΟΡΤΥΝΙΑΣ",
            69 => "ΔΗΜΟΣ ΓΡΕΒΕΝΩΝ",
            70 => "ΔΗΜΟΣ ΔΑΦΝΗΣ - ΥΜΗΤΤΟΥ",
            71 => "ΔΗΜΟΣ ΔΕΛΤΑ",
            72 => "ΔΗΜΟΣ ΔΕΛΦΩΝ",
            73 => "ΔΗΜΟΣ ΔΕΣΚΑΤΗΣ",
            74 => "ΔΗΜΟΣ ΔΙΔΥΜΟΤΕΙΧΟΥ",
            75 => "ΔΗΜΟΣ ΔΙΟΝΥΣΟΥ",
            76 => "ΔΗΜΟΣ ΔΙΟΥ - ΟΛΥΜΠΟΥ",
            77 => "ΔΗΜΟΣ ΔΙΡΦΥΩΝ - ΜΕΣΣΑΠΙΩΝ",
            78 => "ΔΗΜΟΣ ΔΙΣΤΟΜΟΥ - ΑΡΑΧΩΒΑΣ - ΑΝΤΙΚΥΡΑΣ",
            79 => "ΔΗΜΟΣ ΔΟΜΟΚΟΥ",
            80 => "ΔΗΜΟΣ ΔΟΞΑΤΟΥ",
            81 => "ΔΗΜΟΣ ΔΡΑΜΑΣ",
            82 => "ΔΗΜΟΣ ΔΥΤΙΚΗΣ ΑΧΑΙΑΣ",
            83 => "ΔΗΜΟΣ ΔΥΤΙΚΗΣ ΜΑΝΗΣ",
            84 => "ΔΗΜΟΣ ΔΩΔΩΝΗΣ",
            85 => "ΔΗΜΟΣ ΔΩΡΙΔΟΣ",
            86 => "ΔΗΜΟΣ ΕΔΕΣΣΑΣ",
            87 => "ΔΗΜΟΣ ΕΛΑΣΣΟΝΑΣ",
            88 => "ΔΗΜΟΣ ΕΛΑΦΟΝΗΣΟΥ",
            89 => "ΔΗΜΟΣ ΕΛΕΥΣΙΝΑΣ",
            90 => "ΔΗΜΟΣ ΕΛΛΗΝΙΚΟΥ - ΑΡΓΥΡΟΥΠΟΛΗΣ",
            91 => "ΔΗΜΟΣ ΕΜΜΑΝΟΥΗΛ ΠΑΠΠΑ",
            92 => "ΔΗΜΟΣ ΕΟΡΔΑΙΑΣ",
            93 => "ΔΗΜΟΣ ΕΠΙΔΑΥΡΟΥ",
            94 => "ΔΗΜΟΣ ΕΡΕΤΡΙΑΣ",
            95 => "ΔΗΜΟΣ ΕΡΜΙΟΝΙΔΑΣ",
            96 => "ΔΗΜΟΣ ΕΡΥΜΑΝΘΟΥ",
            97 => "ΔΗΜΟΣ ΕΥΡΩΤΑ",
            98 => "ΔΗΜΟΣ ΖΑΓΟΡΑΣ - ΜΟΥΡΕΣΙΟΥ",
            99 => "ΔΗΜΟΣ ΖΑΓΟΡΙΟΥ",
            100 => "ΔΗΜΟΣ ΖΑΚΥΝΘΟΥ",
            101 => "ΔΗΜΟΣ ΖΑΧΑΡΩΣ",
            102 => "ΔΗΜΟΣ ΖΗΡΟΥ",
            103 => "ΔΗΜΟΣ ΖΙΤΣΑΣ",
            104 => "ΔΗΜΟΣ ΖΩΓΡΑΦΟΥ",
            105 => "ΔΗΜΟΣ ΗΓΟΥΜΕΝΙΤΣΑΣ",
            106 => "ΔΗΜΟΣ ΗΛΙΔΑΣ",
            107 => "ΔΗΜΟΣ ΗΛΙΟΥΠΟΛΕΩΣ",
            108 => "ΔΗΜΟΣ ΗΡΑΚΛΕΙΑΣ",
            109 => "ΔΗΜΟΣ ΗΡΑΚΛΕΙΟΥ",
            110 => "ΔΗΜΟΣ ΗΡΑΚΛΕΙΟΥ",
            111 => "ΔΗΜΟΣ ΘΑΣΟΥ",
            112 => "ΔΗΜΟΣ ΘΕΡΜΑΙΚΟΥ",
            113 => "ΔΗΜΟΣ ΘΕΡΜΗΣ",
            114 => "ΔΗΜΟΣ ΘΕΡΜΟΥ",
            115 => "ΔΗΜΟΣ ΘΕΣΣΑΛΟΝΙΚΗΣ",
            116 => "ΔΗΜΟΣ ΘΗΒΑΙΩΝ",
            117 => "ΔΗΜΟΣ ΘΗΡΑΣ",
            118 => "ΔΗΜΟΣ ΙΑΣΜΟΥ",
            119 => "ΔΗΜΟΣ ΙΕΡΑΠΕΤΡΑΣ",
            120 => "ΔΗΜΟΣ ΙΕΡΑΣ ΠΟΛΗΣ ΜΕΣΟΛΟΓΓΙΟΥ",
            121 => "ΔΗΜΟΣ ΙΗΤΩΝ",
            122 => "ΔΗΜΟΣ ΙΘΑΚΗΣ",
            123 => "ΔΗΜΟΣ ΙΚΑΡΙΑΣ",
            124 => "ΔΗΜΟΣ ΙΛΙΟΥ",
            125 => "ΔΗΜΟΣ ΙΣΤΙΑΙΑΣ - ΑΙΔΗΨΟΥ",
            126 => "ΔΗΜΟΣ ΙΩΑΝΝΙΤΩΝ",
            127 => "ΔΗΜΟΣ ΚΑΒΑΛΑΣ",
            128 => "ΔΗΜΟΣ ΚΑΙΣΑΡΙΑΝΗΣ",
            129 => "ΔΗΜΟΣ ΚΑΛΑΒΡΥΤΩΝ",
            130 => "ΔΗΜΟΣ ΚΑΛΑΜΑΡΙΑΣ",
            131 => "ΔΗΜΟΣ ΚΑΛΑΜΑΤΑΣ",
            132 => "ΔΗΜΟΣ ΚΑΛΑΜΠΑΚΑΣ",
            133 => "ΔΗΜΟΣ ΚΑΛΛΙΘΕΑΣ",
            134 => "ΔΗΜΟΣ ΚΑΛΥΜΝΙΩΝ",
            135 => "ΔΗΜΟΣ ΚΑΝΤΑΝΟΥ - ΣΕΛΙΝΟΥ",
            136 => "ΔΗΜΟΣ ΚΑΡΔΙΤΣΑΣ",
            137 => "ΔΗΜΟΣ ΚΑΡΠΑΘΟΥ",
            138 => "ΔΗΜΟΣ ΚΑΡΠΕΝΗΣΙΟΥ",
            139 => "ΔΗΜΟΣ ΚΑΡΥΣΤΟΥ",
            140 => "ΔΗΜΟΣ ΚΑΣΟΥ",
            141 => "ΔΗΜΟΣ ΚΑΣΣΑΝΔΡΑΣ",
            142 => "ΔΗΜΟΣ ΚΑΣΤΟΡΙΑΣ",
            143 => "ΔΗΜΟΣ ΚΑΤΕΡΙΝΗΣ",
            144 => "ΔΗΜΟΣ ΚΑΤΩ ΝΕΥΡΟΚΟΠΙΟΥ",
            145 => "ΔΗΜΟΣ ΚΕΑΣ",
            146 => "ΔΗΜΟΣ ΚΕΝΤΡΙΚΩΝ ΤΖΟΥΜΕΡΚΩΝ",
            147 => "ΔΗΜΟΣ ΚΕΡΑΤΣΙΝΙΟΥ - ΔΡΑΠΕΤΣΩΝΑΣ",
            148 => "ΔΗΜΟΣ ΚΕΡΚΥΡΑΣ",
            149 => "ΔΗΜΟΣ ΚΕΦΑΛΛΟΝΙΑΣ",
            150 => "ΔΗΜΟΣ ΚΗΦΙΣΙΑΣ",
            151 => "ΔΗΜΟΣ ΚΙΛΕΛΕΡ",
            152 => "ΔΗΜΟΣ ΚΙΛΚΙΣ",
            153 => "ΔΗΜΟΣ ΚΙΜΩΛΟΥ",
            154 => "ΔΗΜΟΣ ΚΙΣΣΑΜΟΥ",
            155 => "ΔΗΜΟΣ ΚΟΖΑΝΗΣ",
            156 => "ΔΗΜΟΣ ΚΟΜΟΤΗΝΗΣ",
            157 => "ΔΗΜΟΣ ΚΟΝΙΤΣΑΣ",
            158 => "ΔΗΜΟΣ ΚΟΡΔΕΛΙΟΥ - ΕΥΟΣΜΟΥ",
            159 => "ΔΗΜΟΣ ΚΟΡΙΝΘΙΩΝ",
            160 => "ΔΗΜΟΣ ΚΟΡΥΔΑΛΛΟΥ",
            161 => "ΔΗΜΟΣ ΚΡΩΠΙΑΣ",
            162 => "ΔΗΜΟΣ ΚΥΘΗΡΩΝ",
            163 => "ΔΗΜΟΣ ΚΥΘΝΟΥ",
            164 => "ΔΗΜΟΣ ΚΥΜΗΣ - ΑΛΙΒΕΡΙΟΥ",
            165 => "ΔΗΜΟΣ ΚΩ",
            166 => "ΔΗΜΟΣ ΛΑΓΚΑΔΑ",
            167 => "ΔΗΜΟΣ ΛΑΜΙΕΩΝ",
            168 => "ΔΗΜΟΣ ΛΑΡΙΣΑΙΩΝ",
            169 => "ΔΗΜΟΣ ΛΑΥΡΕΩΤΙΚΗΣ",
            170 => "ΔΗΜΟΣ ΛΕΒΑΔΕΩΝ",
            171 => "ΔΗΜΟΣ ΛΕΙΨΩΝ",
            172 => "ΔΗΜΟΣ ΛΕΡΟΥ",
            173 => "ΔΗΜΟΣ ΛΕΣΒΟΥ",
            174 => "ΔΗΜΟΣ ΛΕΥΚΑΔΑΣ",
            175 => "ΔΗΜΟΣ ΛΗΜΝΟΥ",
            176 => "ΔΗΜΟΣ ΛΙΜΝΗΣ ΠΛΑΣΤΗΡΑ",
            177 => "ΔΗΜΟΣ ΛΟΚΡΩΝ",
            178 => "ΔΗΜΟΣ ΛΟΥΤΡΑΚΙΟΥ - ΑΓΙΩΝ ΘΕΟΔΩΡΩΝ",
            179 => "ΔΗΜΟΣ ΛΥΚΟΒΡΥΣΗΣ - ΠΕΥΚΗΣ",
            180 => "ΔΗΜΟΣ ΜΑΚΡΑΚΩΜΗΣ",
            181 => "ΔΗΜΟΣ ΜΑΛΕΒΙΖΙΟΥ",
            182 => "ΔΗΜΟΣ ΜΑΝΔΡΑΣ - ΕΙΔΥΛΛΙΑΣ",
            183 => "ΔΗΜΟΣ ΜΑΝΤΟΥΔΙΟΥ - ΛΙΜΝΗΣ - ΑΓΙΑΣ ΑΝΝΑΣ",
            184 => "ΔΗΜΟΣ ΜΑΡΑΘΩΝΟΣ",
            185 => "ΔΗΜΟΣ ΜΑΡΚΟΠΟΥΛΟΥ ΜΕΣΟΓΑΙΑΣ",
            186 => "ΔΗΜΟΣ ΜΑΡΩΝΕΙΑΣ - ΣΑΠΩΝ",
            187 => "ΔΗΜΟΣ ΜΕΓΑΛΟΠΟΛΗΣ",
            188 => "ΔΗΜΟΣ ΜΕΓΑΝΗΣΙΟΥ",
            189 => "ΔΗΜΟΣ ΜΕΓΑΡΕΩΝ",
            190 => "ΔΗΜΟΣ ΜΕΓΙΣΤΗΣ",
            191 => "ΔΗΜΟΣ ΜΕΣΣΗΝΗΣ",
            192 => "ΔΗΜΟΣ ΜΕΤΑΜΟΡΦΩΣΕΩΣ",
            193 => "ΔΗΜΟΣ ΜΕΤΣΟΒΟΥ",
            194 => "ΔΗΜΟΣ ΜΗΛΟΥ",
            195 => "ΔΗΜΟΣ ΜΙΝΩΑ ΠΕΔΙΑΔΑΣ",
            196 => "ΔΗΜΟΣ ΜΟΝΕΜΒΑΣΙΑΣ",
            197 => "ΔΗΜΟΣ ΜΟΣΧΑΤΟΥ - ΤΑΥΡΟΥ",
            198 => "ΔΗΜΟΣ ΜΟΥΖΑΚΙΟΥ",
            199 => "ΔΗΜΟΣ ΜΥΚΗΣ",
            200 => "ΔΗΜΟΣ ΜΥΚΟΝΟΥ",
            201 => "ΔΗΜΟΣ ΜΥΛΟΠΟΤΑΜΟΥ",
            202 => "ΔΗΜΟΣ ΜΩΛΟΥ ΑΓΙΟΥ ΚΩΝΣΤΑΝΤΙΝΟΥ",
            203 => "ΔΗΜΟΣ ΝΑΞΟΥ ΚΑΙ ΜΙΚΡΩΝ ΚΥΚΛΑΔΩΝ",
            204 => "ΔΗΜΟΣ ΝΑΟΥΣΑΣ",
            205 => "ΔΗΜΟΣ ΝΑΥΠΑΚΤΙΑΣ",
            206 => "ΔΗΜΟΣ ΝΑΥΠΛΙΕΩΝ",
            207 => "ΔΗΜΟΣ ΝΕΑΠΟΛΗΣ - ΣΥΚΕΩΝ",
            208 => "ΔΗΜΟΣ ΝΕΑΣ ΖΙΧΝΗΣ",
            209 => "ΔΗΜΟΣ ΝΕΑΣ ΙΩΝΙΑΣ",
            210 => "ΔΗΜΟΣ ΝΕΑΣ ΠΡΟΠΟΝΤΙΔΑΣ",
            211 => "ΔΗΜΟΣ ΝΕΑΣ ΣΜΥΡΝΗΣ",
            212 => "ΔΗΜΟΣ ΝΕΜΕΑΣ",
            213 => "ΔΗΜΟΣ ΝΕΣΤΟΡΙΟΥ",
            214 => "ΔΗΜΟΣ ΝΕΣΤΟΥ",
            215 => "ΔΗΜΟΣ ΝΙΚΑΙΑΣ - ΑΓΙΟΥ ΙΩΑΝΝΗ ΡΕΝΤΗ",
            216 => "ΔΗΜΟΣ ΝΙΚΟΛΑΟΥ ΣΚΟΥΦΑ",
            217 => "ΔΗΜΟΣ ΝΙΣΥΡΟΥ",
            218 => "ΔΗΜΟΣ ΝΟΤΙΑΣ ΚΥΝΟΥΡΙΑΣ",
            219 => "ΔΗΜΟΣ ΝΟΤΙΟΥ ΠΗΛΙΟΥ",
            220 => "ΔΗΜΟΣ ΞΑΝΘΗΣ",
            221 => "ΔΗΜΟΣ ΞΥΛΟΚΑΣΤΡΟΥ - ΕΥΡΩΣΤΙΝΗΣ",
            222 => "ΔΗΜΟΣ ΞΥΡΟΜΕΡΟΥ",
            223 => "ΔΗΜΟΣ ΟΙΝΟΥΣΣΩΝ",
            224 => "ΔΗΜΟΣ ΟΙΧΑΛΙΑΣ",
            225 => "ΔΗΜΟΣ ΟΡΕΣΤΙΑΔΑΣ",
            226 => "ΔΗΜΟΣ ΟΡΕΣΤΙΔΟΣ",
            227 => "ΔΗΜΟΣ ΟΡΟΠΕΔΙΟΥ ΛΑΣΙΘΙΟΥ",
            228 => "ΔΗΜΟΣ ΟΡΧΟΜΕΝΟΥ",
            229 => "ΔΗΜΟΣ ΠΑΓΓΑΙΟΥ",
            230 => "ΔΗΜΟΣ ΠΑΙΑΝΙΑΣ",
            231 => "ΔΗΜΟΣ ΠΑΙΟΝΙΑΣ",
            232 => "ΔΗΜΟΣ ΠΑΛΑΙΟΥ ΦΑΛΗΡΟΥ",
            233 => "ΔΗΜΟΣ ΠΑΛΑΜΑ",
            234 => "ΔΗΜΟΣ ΠΑΛΛΗΝΗΣ",
            235 => "ΔΗΜΟΣ ΠΑΞΩΝ",
            236 => "ΔΗΜΟΣ ΠΑΠΑΓΟΥ - ΧΟΛΑΡΓΟΥ",
            237 => "ΔΗΜΟΣ ΠΑΡΑΝΕΣΤΙΟΥ",
            238 => "ΔΗΜΟΣ ΠΑΡΓΑΣ",
            239 => "ΔΗΜΟΣ ΠΑΡΟΥ",
            240 => "ΔΗΜΟΣ ΠΑΤΜΟΥ",
            241 => "ΔΗΜΟΣ ΠΑΤΡΕΩΝ",
            242 => "ΔΗΜΟΣ ΠΑΥΛΟΥ ΜΕΛΑ",
            243 => "ΔΗΜΟΣ ΠΕΙΡΑΙΩΣ",
            244 => "ΔΗΜΟΣ ΠΕΛΛΑΣ",
            245 => "ΔΗΜΟΣ ΠΕΝΤΕΛΗΣ",
            246 => "ΔΗΜΟΣ ΠΕΡΑΜΑΤΟΣ",
            247 => "ΔΗΜΟΣ ΠΕΡΙΣΤΕΡΙΟΥ",
            248 => "ΔΗΜΟΣ ΠΕΤΡΟΥΠΟΛΕΩΣ",
            249 => "ΔΗΜΟΣ ΠΗΝΕΙΟΥ",
            250 => "ΔΗΜΟΣ ΠΛΑΤΑΝΙΑ",
            251 => "ΔΗΜΟΣ ΠΟΛΥΓΥΡΟΥ",
            252 => "ΔΗΜΟΣ ΠΟΡΟΥ",
            253 => "ΔΗΜΟΣ ΠΡΕΒΕΖΑΣ",
            254 => "ΔΗΜΟΣ ΠΡΕΣΠΩΝ",
            255 => "ΔΗΜΟΣ ΠΡΟΣΟΤΣΑΝΗΣ",
            256 => "ΔΗΜΟΣ ΠΥΔΝΑΣ - ΚΟΛΙΝΔΡΟΥ",
            257 => "ΔΗΜΟΣ ΠΥΛΑΙΑΣ - ΧΟΡΤΙΑΤΗ",
            258 => "ΔΗΜΟΣ ΠΥΛΗΣ",
            259 => "ΔΗΜΟΣ ΠΥΛΟΥ - ΝΕΣΤΩΡΟΣ",
            260 => "ΔΗΜΟΣ ΠΥΡΓΟΥ",
            261 => "ΔΗΜΟΣ ΠΩΓΩΝΙΟΥ",
            262 => "ΔΗΜΟΣ ΡΑΦΗΝΑΣ - ΠΙΚΕΡΜΙΟΥ",
            263 => "ΔΗΜΟΣ ΡΕΘΥΜΝΗΣ",
            264 => "ΔΗΜΟΣ ΡΗΓΑ ΦΕΡΑΙΟΥ",
            265 => "ΔΗΜΟΣ ΡΟΔΟΥ",
            266 => "ΔΗΜΟΣ ΣΑΛΑΜΙΝΑΣ",
            267 => "ΔΗΜΟΣ ΣΑΜΟΘΡΑΚΗΣ",
            268 => "ΔΗΜΟΣ ΣΑΜΟΥ",
            269 => "ΔΗΜΟΣ ΣΑΡΩΝΙΚΟΥ",
            270 => "ΔΗΜΟΣ ΣΕΡΒΙΩΝ - ΒΕΛΒΕΝΤΟΥ",
            271 => "ΔΗΜΟΣ ΣΕΡΙΦΟΥ",
            272 => "ΔΗΜΟΣ ΣΕΡΡΩΝ",
            273 => "ΔΗΜΟΣ ΣΗΤΕΙΑΣ",
            274 => "ΔΗΜΟΣ ΣΙΘΩΝΙΑΣ",
            275 => "ΔΗΜΟΣ ΣΙΚΙΝΟΥ",
            276 => "ΔΗΜΟΣ ΣΙΚΥΩΝΙΩΝ",
            277 => "ΔΗΜΟΣ ΣΙΝΤΙΚΗΣ",
            278 => "ΔΗΜΟΣ ΣΙΦΝΟΥ",
            279 => "ΔΗΜΟΣ ΣΚΙΑΘΟΥ",
            280 => "ΔΗΜΟΣ ΣΚΟΠΕΛΟΥ",
            281 => "ΔΗΜΟΣ ΣΚΥΔΡΑΣ",
            282 => "ΔΗΜΟΣ ΣΚΥΡΟΥ",
            283 => "ΔΗΜΟΣ ΣΟΥΛΙΟΥ",
            284 => "ΔΗΜΟΣ ΣΟΥΦΛΙΟΥ",
            285 => "ΔΗΜΟΣ ΣΟΦΑΔΩΝ",
            286 => "ΔΗΜΟΣ ΣΠΑΡΤΗΣ",
            287 => "ΔΗΜΟΣ ΣΠΑΤΩΝ - ΑΡΤΕΜΙΔΟΣ",
            288 => "ΔΗΜΟΣ ΣΠΕΤΣΩΝ",
            289 => "ΔΗΜΟΣ ΣΤΥΛΙΔΑΣ",
            290 => "ΔΗΜΟΣ ΣΥΜΗΣ",
            291 => "ΔΗΜΟΣ ΣΥΡΟΥ - ΕΡΜΟΥΠΟΛΗΣ",
            292 => "ΔΗΜΟΣ ΣΦΑΚΙΩΝ",
            293 => "ΔΗΜΟΣ ΤΑΝΑΓΡΑΣ",
            294 => "ΔΗΜΟΣ ΤΕΜΠΩΝ",
            295 => "ΔΗΜΟΣ ΤΗΛΟΥ",
            296 => "ΔΗΜΟΣ ΤΗΝΟΥ",
            297 => "ΔΗΜΟΣ ΤΟΠΕΙΡΟΥ",
            298 => "ΔΗΜΟΣ ΤΡΙΚΑΙΩΝ",
            299 => "ΔΗΜΟΣ ΤΡΙΠΟΛΗΣ",
            300 => "ΔΗΜΟΣ ΤΡΙΦΥΛΙΑΣ",
            301 => "ΔΗΜΟΣ ΤΡΟΙΖΗΝΙΑΣ - ΓΑΛΑΤΑ",
            302 => "ΔΗΜΟΣ ΤΥΡΝΑΒΟΥ",
            303 => "ΔΗΜΟΣ ΥΔΡΑΣ",
            304 => "ΔΗΜΟΣ ΦΑΙΣΤΟΥ",
            305 => "ΔΗΜΟΣ ΦΑΡΚΑΔΟΝΑΣ",
            306 => "ΔΗΜΟΣ ΦΑΡΣΑΛΩΝ",
            307 => "ΔΗΜΟΣ ΦΙΛΑΔΕΛΦΕΙΑΣ - ΧΑΛΚΙΔΟΝΟΣ",
            308 => "ΔΗΜΟΣ ΦΙΛΙΑΤΩΝ",
            309 => "ΔΗΜΟΣ ΦΙΛΟΘΕΗΣ - ΨΥΧΙΚΟΥ",
            310 => "ΔΗΜΟΣ ΦΛΩΡΙΝΗΣ",
            311 => "ΔΗΜΟΣ ΦΟΛΕΓΑΝΔΡΟΥ",
            312 => "ΔΗΜΟΣ ΦΟΥΡΝΩΝ ΚΟΡΣΕΩΝ",
            313 => "ΔΗΜΟΣ ΦΥΛΗΣ",
            314 => "ΔΗΜΟΣ ΧΑΛΑΝΔΡΙΟΥ",
            315 => "ΔΗΜΟΣ ΧΑΛΚΗΔΟΝΟΣ",
            316 => "ΔΗΜΟΣ ΧΑΛΚΗΣ",
            317 => "ΔΗΜΟΣ ΧΑΛΚΙΔΕΩΝ",
            318 => "ΔΗΜΟΣ ΧΑΝΙΩΝ",
            319 => "ΔΗΜΟΣ ΧΑΪΔΑΡΙΟΥ",
            320 => "ΔΗΜΟΣ ΧΕΡΣΟΝΗΣΟΥ",
            321 => "ΔΗΜΟΣ ΧΙΟΥ",
            322 => "ΔΗΜΟΣ ΨΑΡΩΝ",
            323 => "ΔΗΜΟΣ ΩΡΑΙΟΚΑΣΤΡΟΥ",
            324 => "ΔΗΜΟΣ ΩΡΩΠΟΥ",
        );
    }

    public function __toString() {
        return $this->getName();
    }
}